app/controllers/products_controller.rb

INSERT INTO "products" ("name", "value", "store_id", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "asdfasdf"], ["value", 1212.0], ["store_id", 1], ["created_at", "2018-05-03 17:47:01.838638"], ["updated_at", "2018-05-03 17:47:01.838638"], ["description", "asdfasdfasdf"]]
---
  def create
    @product = Product.new(params.require(:product).permit(:name, :value, :store_id))
    if @product.save