app/controllers/stores_controller.rb

  def create
    @store = Store.new(params.require(:store).permit(:name, :slogan))
    if @store.save
---
INSERT INTO "stores" ("name", "created_at", "updated_at", "slogan") VALUES (?, ?, ?, ?)  [["name", "Ferraz"], ["created_at", "2018-05-08 18:00:02.262599"], ["updated_at", "2018-05-08 18:00:02.262599"], ["slogan", "Vasconcelos"]]

  def show
    @store = Store.find(params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]